'=================GIT==============================='
# это распределенная система контроля версий(это сиситрема, заприсывающая изменения в файлах или наборе файлах в теченни времен)Преднозначен для ослеживания и ведения истории измения файлов, в вашем проекте

'=============================GITHUB===================='
# это сайт куда я могу отправить все что нходиттся на моем ноутбуке, чтобы другие люди могли просмотреть мой код и мой прогресс, так же использовать мой код

'Репозиторий'
# 1.локальный(на ПК)
# 2.удаленный(на каком-то сервисе, который предоставляет репозиторий (GITHUB))
